grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_odr PIOODR Output Disable Register
@{*/

/** PIOB_PIO_ODR_P31 Output Disable **/
#define PIOB_PIO_ODR_P31		(1 << 31)
/** PIOB_PIO_ODR_P30 Output Disable **/
#define PIOB_PIO_ODR_P30		(1 << 30)
/** PIOB_PIO_ODR_P29 Output Disable **/
#define PIOB_PIO_ODR_P29		(1 << 29)
/** PIOB_PIO_ODR_P28 Output Disable **/
#define PIOB_PIO_ODR_P28		(1 << 28)
/** PIOB_PIO_ODR_P27 Output Disable **/
#define PIOB_PIO_ODR_P27		(1 << 27)
/** PIOB_PIO_ODR_P26 Output Disable **/
#define PIOB_PIO_ODR_P26		(1 << 26)
/** PIOB_PIO_ODR_P25 Output Disable **/
#define PIOB_PIO_ODR_P25		(1 << 25)
/** PIOB_PIO_ODR_P24 Output Disable **/
#define PIOB_PIO_ODR_P24		(1 << 24)
/** PIOB_PIO_ODR_P23 Output Disable **/
#define PIOB_PIO_ODR_P23		(1 << 23)
/** PIOB_PIO_ODR_P22 Output Disable **/
#define PIOB_PIO_ODR_P22		(1 << 22)
/** PIOB_PIO_ODR_P21 Output Disable **/
#define PIOB_PIO_ODR_P21		(1 << 21)
/** PIOB_PIO_ODR_P20 Output Disable **/
#define PIOB_PIO_ODR_P20		(1 << 20)
/** PIOB_PIO_ODR_P19 Output Disable **/
#define PIOB_PIO_ODR_P19		(1 << 19)
/** PIOB_PIO_ODR_P18 Output Disable **/
#define PIOB_PIO_ODR_P18		(1 << 18)
/** PIOB_PIO_ODR_P17 Output Disable **/
#define PIOB_PIO_ODR_P17		(1 << 17)
/** PIOB_PIO_ODR_P16 Output Disable **/
#define PIOB_PIO_ODR_P16		(1 << 16)
/** PIOB_PIO_ODR_P15 Output Disable **/
#define PIOB_PIO_ODR_P15		(1 << 15)
/** PIOB_PIO_ODR_P14 Output Disable **/
#define PIOB_PIO_ODR_P14		(1 << 14)
/** PIOB_PIO_ODR_P13 Output Disable **/
#define PIOB_PIO_ODR_P13		(1 << 13)
/** PIOB_PIO_ODR_P12 Output Disable **/
#define PIOB_PIO_ODR_P12		(1 << 12)
/** PIOB_PIO_ODR_P11 Output Disable **/
#define PIOB_PIO_ODR_P11		(1 << 11)
/** PIOB_PIO_ODR_P10 Output Disable **/
#define PIOB_PIO_ODR_P10		(1 << 10)
/** PIOB_PIO_ODR_P9 Output Disable **/
#define PIOB_PIO_ODR_P9		(1 << 9)
/** PIOB_PIO_ODR_P8 Output Disable **/
#define PIOB_PIO_ODR_P8		(1 << 8)
/** PIOB_PIO_ODR_P7 Output Disable **/
#define PIOB_PIO_ODR_P7		(1 << 7)
/** PIOB_PIO_ODR_P6 Output Disable **/
#define PIOB_PIO_ODR_P6		(1 << 6)
/** PIOB_PIO_ODR_P5 Output Disable **/
#define PIOB_PIO_ODR_P5		(1 << 5)
/** PIOB_PIO_ODR_P4 Output Disable **/
#define PIOB_PIO_ODR_P4		(1 << 4)
/** PIOB_PIO_ODR_P3 Output Disable **/
#define PIOB_PIO_ODR_P3		(1 << 3)
/** PIOB_PIO_ODR_P2 Output Disable **/
#define PIOB_PIO_ODR_P2		(1 << 2)
/** PIOB_PIO_ODR_P1 Output Disable **/
#define PIOB_PIO_ODR_P1		(1 << 1)
/** PIOB_PIO_ODR_P0 Output Disable **/
#define PIOB_PIO_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_osr PIOOSR Output Status Register
@{*/

/** PIOB_PIO_OSR_P31 Output Status **/
#define PIOB_PIO_OSR_P31		(1 << 31)
/** PIOB_PIO_OSR_P30 Output Status **/
#define PIOB_PIO_OSR_P30		(1 << 30)
/** PIOB_PIO_OSR_P29 Output Status **/
#define PIOB_PIO_OSR_P29		(1 << 29)
/** PIOB_PIO_OSR_P28 Output Status **/
#define PIOB_PIO_OSR_P28		(1 << 28)
/** PIOB_PIO_OSR_P27 Output Status **/
#define PIOB_PIO_OSR_P27		(1 << 27)
/** PIOB_PIO_OSR_P26 Output Status **/
#define PIOB_PIO_OSR_P26		(1 << 26)
/** PIOB_PIO_OSR_P25 Output Status **/
#define PIOB_PIO_OSR_P25		(1 << 25)
/** PIOB_PIO_OSR_P24 Output Status **/
#define PIOB_PIO_OSR_P24		(1 << 24)
/** PIOB_PIO_OSR_P23 Output Status **/
#define PIOB_PIO_OSR_P23		(1 << 23)
/** PIOB_PIO_OSR_P22 Output Status **/
#define PIOB_PIO_OSR_P22		(1 << 22)
/** PIOB_PIO_OSR_P21 Output Status **/
#define PIOB_PIO_OSR_P21		(1 << 21)
/** PIOB_PIO_OSR_P20 Output Status **/
#define PIOB_PIO_OSR_P20		(1 << 20)
/** PIOB_PIO_OSR_P19 Output Status **/
#define PIOB_PIO_OSR_P19		(1 << 19)
/** PIOB_PIO_OSR_P18 Output Status **/
#define PIOB_PIO_OSR_P18		(1 << 18)
/** PIOB_PIO_OSR_P17 Output Status **/
#define PIOB_PIO_OSR_P17		(1 << 17)
/** PIOB_PIO_OSR_P16 Output Status **/
#define PIOB_PIO_OSR_P16		(1 << 16)
/** PIOB_PIO_OSR_P15 Output Status **/
#define PIOB_PIO_OSR_P15		(1 << 15)
/** PIOB_PIO_OSR_P14 Output Status **/
#define PIOB_PIO_OSR_P14		(1 << 14)
/** PIOB_PIO_OSR_P13 Output Status **/
#define PIOB_PIO_OSR_P13		(1 << 13)
/** PIOB_PIO_OSR_P12 Output Status **/
#define PIOB_PIO_OSR_P12		(1 << 12)
/** PIOB_PIO_OSR_P11 Output Status **/
#define PIOB_PIO_OSR_P11		(1 << 11)
/** PIOB_PIO_OSR_P10 Output Status **/
#define PIOB_PIO_OSR_P10		(1 << 10)
/** PIOB_PIO_OSR_P9 Output Status **/
#define PIOB_PIO_OSR_P9		(1 << 9)
/** PIOB_PIO_OSR_P8 Output Status **/
#define PIOB_PIO_OSR_P8		(1 << 8)
/** PIOB_PIO_OSR_P7 Output Status **/
#define PIOB_PIO_OSR_P7		(1 << 7)
/** PIOB_PIO_OSR_P6 Output Status **/
#define PIOB_PIO_OSR_P6		(1 << 6)
/** PIOB_PIO_OSR_P5 Output Status **/
#define PIOB_PIO_OSR_P5		(1 << 5)
/** PIOB_PIO_OSR_P4 Output Status **/
#define PIOB_PIO_OSR_P4		(1 << 4)
/** PIOB_PIO_OSR_P3 Output Status **/
#define PIOB_PIO_OSR_P3		(1 << 3)
/** PIOB_PIO_OSR_P2 Output Status **/
#define PIOB_PIO_OSR_P2		(1 << 2)
/** PIOB_PIO_OSR_P1 Output Status **/
#define PIOB_PIO_OSR_P1		(1 << 1)
/** PIOB_PIO_OSR_P0 Output Status **/
#define PIOB_PIO_OSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifer PIOIFER Glitch Input Filter Enable Register
@{*/

/** PIOB_PIO_IFER_P31 Input Filter Enable **/
#define PIOB_PIO_IFER_P31		(1 << 31)
/** PIOB_PIO_IFER_P30 Input Filter Enable **/
#define PIOB_PIO_IFER_P30		(1 << 30)
/** PIOB_PIO_IFER_P29 Input Filter Enable **/
#define PIOB_PIO_IFER_P29		(1 << 29)
/** PIOB_PIO_IFER_P28 Input Filter Enable **/
#define PIOB_PIO_IFER_P28		(1 << 28)
/** PIOB_PIO_IFER_P27 Input Filter Enable **/
#define PIOB_PIO_IFER_P27		(1 << 27)
/** PIOB_PIO_IFER_P26 Input Filter Enable **/
#define PIOB_PIO_IFER_P26		(1 << 26)
/** PIOB_PIO_IFER_P25 Input Filter Enable **/
#define PIOB_PIO_IFER_P25		(1 << 25)
/** PIOB_PIO_IFER_P24 Input Filter Enable **/
#define PIOB_PIO_IFER_P24		(1 << 24)
/** PIOB_PIO_IFER_P23 Input Filter Enable **/
#define PIOB_PIO_IFER_P23		(1 << 23)
/** PIOB_PIO_IFER_P22 Input Filter Enable **/
#define PIOB_PIO_IFER_P22		(1 << 22)
/** PIOB_PIO_IFER_P21 Input Filter Enable **/
#define PIOB_PIO_IFER_P21		(1 << 21)
/** PIOB_PIO_IFER_P20 Input Filter Enable **/
#define PIOB_PIO_IFER_P20		(1 << 20)
/** PIOB_PIO_IFER_P19 Input Filter Enable **/
#define PIOB_PIO_IFER_P19		(1 << 19)
/** PIOB_PIO_IFER_P18 Input Filter Enable **/
#define PIOB_PIO_IFER_P18		(1 << 18)
/** PIOB_PIO_IFER_P17 Input Filter Enable **/
#define PIOB_PIO_IFER_P17		(1 << 17)
/** PIOB_PIO_IFER_P16 Input Filter Enable **/
#define PIOB_PIO_IFER_P16		(1 << 16)
/** PIOB_PIO_IFER_P15 Input Filter Enable **/
#define PIOB_PIO_IFER_P15		(1 << 15)
/** PIOB_PIO_IFER_P14 Input Filter Enable **/
#define PIOB_PIO_IFER_P14		(1 << 14)
/** PIOB_PIO_IFER_P13 Input Filter Enable **/
#define PIOB_PIO_IFER_P13		(1 << 13)
/** PIOB_PIO_IFER_P12 Input Filter Enable **/
#define PIOB_PIO_IFER_P12		(1 << 12)
/** PIOB_PIO_IFER_P11 Input Filter Enable **/
#define PIOB_PIO_IFER_P11		(1 << 11)
/** PIOB_PIO_IFER_P10 Input Filter Enable **/
#define PIOB_PIO_IFER_P10		(1 << 10)
/** PIOB_PIO_IFER_P9 Input Filter Enable **/
#define PIOB_PIO_IFER_P9		(1 << 9)
/** PIOB_PIO_IFER_P8 Input Filter Enable **/
#define PIOB_PIO_IFER_P8		(1 << 8)
/** PIOB_PIO_IFER_P7 Input Filter Enable **/
#define PIOB_PIO_IFER_P7		(1 << 7)
/** PIOB_PIO_IFER_P6 Input Filter Enable **/
#define PIOB_PIO_IFER_P6		(1 << 6)
/** PIOB_PIO_IFER_P5 Input Filter Enable **/
#define PIOB_PIO_IFER_P5		(1 << 5)
/** PIOB_PIO_IFER_P4 Input Filter Enable **/
#define PIOB_PIO_IFER_P4		(1 << 4)
/** PIOB_PIO_IFER_P3 Input Filter Enable **/
#define PIOB_PIO_IFER_P3		(1 << 3)
/** PIOB_PIO_IFER_P2 Input Filter Enable **/
#define PIOB_PIO_IFER_P2		(1 << 2)
/** PIOB_PIO_IFER_P1 Input Filter Enable **/
#define PIOB_PIO_IFER_P1		(1 << 1)
/** PIOB_PIO_IFER_P0 Input Filter Enable **/
#define PIOB_PIO_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifdr PIOIFDR Glitch Input Filter Disable Register
@{*/

/** PIOB_PIO_IFDR_P31 Input Filter Disable **/
#define PIOB_PIO_IFDR_P31		(1 << 31)
/** PIOB_PIO_IFDR_P30 Input Filter Disable **/
#define PIOB_PIO_IFDR_P30		(1 << 30)
/** PIOB_PIO_IFDR_P29 Input Filter Disable **/
#define PIOB_PIO_IFDR_P29		(1 << 29)
/** PIOB_PIO_IFDR_P28 Input Filter Disable **/
#define PIOB_PIO_IFDR_P28		(1 << 28)
/** PIOB_PIO_IFDR_P27 Input Filter Disable **/
#define PIOB_PIO_IFDR_P27		(1 << 27)
/** PIOB_PIO_IFDR_P26 Input Filter Disable **/
#define PIOB_PIO_IFDR_P26		(1 << 26)
/** PIOB_PIO_IFDR_P25 Input Filter Disable **/
#define PIOB_PIO_IFDR_P25		(1 << 25)
/** PIOB_PIO_IFDR_P24 Input Filter Disable **/
#define PIOB_PIO_IFDR_P24		(1 << 24)
/** PIOB_PIO_IFDR_P23 Input Filter Disable **/
#define PIOB_PIO_IFDR_P23		(1 << 23)
/** PIOB_PIO_IFDR_P22 Input Filter Disable **/
#define PIOB_PIO_IFDR_P22		(1 << 22)
/** PIOB_PIO_IFDR_P21 Input Filter Disable **/
#define PIOB_PIO_IFDR_P21		(1 << 21)
/** PIOB_PIO_IFDR_P20 Input Filter Disable **/
#define PIOB_PIO_IFDR_P20		(1 << 20)
/** PIOB_PIO_IFDR_P19 Input Filter Disable **/
#define PIOB_PIO_IFDR_P19		(1 << 19)
/** PIOB_PIO_IFDR_P18 Input Filter Disable **/
#define PIOB_PIO_IFDR_P18		(1 << 18)
/** PIOB_PIO_IFDR_P17 Input Filter Disable **/
#define PIOB_PIO_IFDR_P17		(1 << 17)
/** PIOB_PIO_IFDR_P16 Input Filter Disable **/
#define PIOB_PIO_IFDR_P16		(1 << 16)
/** PIOB_PIO_IFDR_P15 Input Filter Disable **/
#define PIOB_PIO_IFDR_P15		(1 << 15)
/** PIOB_PIO_IFDR_P14 Input Filter Disable **/
#define PIOB_PIO_IFDR_P14		(1 << 14)
/** PIOB_PIO_IFDR_P13 Input Filter Disable **/
#define PIOB_PIO_IFDR_P13		(1 << 13)
/** PIOB_PIO_IFDR_P12 Input Filter Disable **/
#define PIOB_PIO_IFDR_P12		(1 << 12)
/** PIOB_PIO_IFDR_P11 Input Filter Disable **/
#define PIOB_PIO_IFDR_P11		(1 << 11)
/** PIOB_PIO_IFDR_P10 Input Filter Disable **/
#define PIOB_PIO_IFDR_P10		(1 << 10)
/** PIOB_PIO_IFDR_P9 Input Filter Disable **/
#define PIOB_PIO_IFDR_P9		(1 << 9)
/** PIOB_PIO_IFDR_P8 Input Filter Disable **/
#define PIOB_PIO_IFDR_P8		(1 << 8)
/** PIOB_PIO_IFDR_P7 Input Filter Disable **/
#define PIOB_PIO_IFDR_P7		(1 << 7)
/** PIOB_PIO_IFDR_P6 Input Filter Disable **/
#define PIOB_PIO_IFDR_P6		(1 << 6)
/** PIOB_PIO_IFDR_P5 Input Filter Disable **/
#define PIOB_PIO_IFDR_P5		(1 << 5)
/** PIOB_PIO_IFDR_P4 Input Filter Disable **/
#define PIOB_PIO_IFDR_P4		(1 << 4)
/** PIOB_PIO_IFDR_P3 Input Filter Disable **/
#define PIOB_PIO_IFDR_P3		(1 << 3)
/** PIOB_PIO_IFDR_P2 Input Filter Disable **/
#define PIOB_PIO_IFDR_P2		(1 << 2)
/** PIOB_PIO_IFDR_P1 Input Filter Disable **/
#define PIOB_PIO_IFDR_P1		(1 << 1)
/** PIOB_PIO_IFDR_P0 Input Filter Disable **/
#define PIOB_PIO_IFDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifsr PIOIFSR Glitch Input Filter Status Register
@{*/

/** PIOB_PIO_IFSR_P31 Input Filter Status **/
#define PIOB_PIO_IFSR_P31		(1 << 31)
/** PIOB_PIO_IFSR_P30 Input Filter Status **/
#define PIOB_PIO_IFSR_P30		(1 << 30)
/** PIOB_PIO_IFSR_P29 Input Filter Status **/
#define PIOB_PIO_IFSR_P29		(1 << 29)
/** PIOB_PIO_IFSR_P28 Input Filter Status **/
#define PIOB_PIO_IFSR_P28		(1 << 28)
/** PIOB_PIO_IFSR_P27 Input Filter Status **/
#define PIOB_PIO_IFSR_P27		(1 << 27)
/** PIOB_PIO_IFSR_P26 Input Filter Status **/
#define PIOB_PIO_IFSR_P26		(1 << 26)
/** PIOB_PIO_IFSR_P25 Input Filter Status **/
#define PIOB_PIO_IFSR_P25		(1 << 25)
/** PIOB_PIO_IFSR_P24 Input Filter Status **/
#define PIOB_PIO_IFSR_P24		(1 << 24)
/** PIOB_PIO_IFSR_P23 Input Filter Status **/
#define PIOB_PIO_IFSR_P23		(1 << 23)
/** PIOB_PIO_IFSR_P22 Input Filter Status **/
#define PIOB_PIO_IFSR_P22		(1 << 22)
/** PIOB_PIO_IFSR_P21 Input Filter Status **/
#define PIOB_PIO_IFSR_P21		(1 << 21)
/** PIOB_PIO_IFSR_P20 Input Filter Status **/
#define PIOB_PIO_IFSR_P20		(1 << 20)
/** PIOB_PIO_IFSR_P19 Input Filter Status **/
#define PIOB_PIO_IFSR_P19		(1 << 19)
/** PIOB_PIO_IFSR_P18 Input Filter Status **/
#define PIOB_PIO_IFSR_P18		(1 << 18)
/** PIOB_PIO_IFSR_P17 Input Filter Status **/
#define PIOB_PIO_IFSR_P17		(1 << 17)
/** PIOB_PIO_IFSR_P16 Input Filter Status **/
#define PIOB_PIO_IFSR_P16		(1 << 16)
/** PIOB_PIO_IFSR_P15 Input Filter Status **/
#define PIOB_PIO_IFSR_P15		(1 << 15)
/** PIOB_PIO_IFSR_P14 Input Filter Status **/
#define PIOB_PIO_IFSR_P14		(1 << 14)
/** PIOB_PIO_IFSR_P13 Input Filter Status **/
#define PIOB_PIO_IFSR_P13		(1 << 13)
/** PIOB_PIO_IFSR_P12 Input Filter Status **/
#define PIOB_PIO_IFSR_P12		(1 << 12)
/** PIOB_PIO_IFSR_P11 Input Filter Status **/
#define PIOB_PIO_IFSR_P11		(1 << 11)
/** PIOB_PIO_IFSR_P10 Input Filter Status **/
#define PIOB_PIO_IFSR_P10		(1 << 10)
/** PIOB_PIO_IFSR_P9 Input Filter Status **/
#define PIOB_PIO_IFSR_P9		(1 << 9)
/** PIOB_PIO_IFSR_P8 Input Filter Status **/
#define PIOB_PIO_IFSR_P8		(1 << 8)
/** PIOB_PIO_IFSR_P7 Input Filter Status **/
#define PIOB_PIO_IFSR_P7		(1 << 7)
/** PIOB_PIO_IFSR_P6 Input Filter Status **/
#define PIOB_PIO_IFSR_P6		(1 << 6)
/** PIOB_PIO_IFSR_P5 Input Filter Status **/
#define PIOB_PIO_IFSR_P5		(1 << 5)
/** PIOB_PIO_IFSR_P4 Input Filter Status **/
#define PIOB_PIO_IFSR_P4		(1 << 4)
/** PIOB_PIO_IFSR_P3 Input Filter Status **/
#define PIOB_PIO_IFSR_P3		(1 << 3)
/** PIOB_PIO_IFSR_P2 Input Filter Status **/
#define PIOB_PIO_IFSR_P2		(1 << 2)
/** PIOB_PIO_IFSR_P1 Input Filter Status **/
#define PIOB_PIO_IFSR_P1		(1 << 1)
/** PIOB_PIO_IFSR_P0 Input Filter Status **/
#define PIOB_PIO_IFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_sodr PIOSODR Set Output Data Register
@{*/

/** PIOB_PIO_SODR_P31 Set Output Data **/
#define PIOB_PIO_SODR_P31		(1 << 31)
/** PIOB_PIO_SODR_P30 Set Output Data **/
#define PIOB_PIO_SODR_P30		(1 << 30)
/** PIOB_PIO_SODR_P29 Set Output Data **/
#define PIOB_PIO_SODR_P29		(1 << 29)
/** PIOB_PIO_SODR_P28 Set Output Data **/
#define PIOB_PIO_SODR_P28		(1 << 28)
/** PIOB_PIO_SODR_P27 Set Output Data **/
#define PIOB_PIO_SODR_P27		(1 << 27)
/** PIOB_PIO_SODR_P26 Set Output Data **/
#define PIOB_PIO_SODR_P26		(1 << 26)
/** PIOB_PIO_SODR_P25 Set Output Data **/
#define PIOB_PIO_SODR_P25		(1 << 25)
/** PIOB_PIO_SODR_P24 Set Output Data **/
#define PIOB_PIO_SODR_P24		(1 << 24)
/** PIOB_PIO_SODR_P23 Set Output Data **/
#define PIOB_PIO_SODR_P23		(1 << 23)
/** PIOB_PIO_SODR_P22 Set Output Data **/
#define PIOB_PIO_SODR_P22		(1 << 22)
/** PIOB_PIO_SODR_P21 Set Output Data **/
#define PIOB_PIO_SODR_P21		(1 << 21)
/** PIOB_PIO_SODR_P20 Set Output Data **/
#define PIOB_PIO_SODR_P20		(1 << 20)
/** PIOB_PIO_SODR_P19 Set Output Data **/
#define PIOB_PIO_SODR_P19		(1 << 19)
/** PIOB_PIO_SODR_P18 Set Output Data **/
#define PIOB_PIO_SODR_P18		(1 << 18)
/** PIOB_PIO_SODR_P17 Set Output Data **/
#define PIOB_PIO_SODR_P17		(1 << 17)
/** PIOB_PIO_SODR_P16 Set Output Data **/
#define PIOB_PIO_SODR_P16		(1 << 16)
/** PIOB_PIO_SODR_P15 Set Output Data **/
#define PIOB_PIO_SODR_P15		(1 << 15)
/** PIOB_PIO_SODR_P14 Set Output Data **/
#define PIOB_PIO_SODR_P14		(1 << 14)
/** PIOB_PIO_SODR_P13 Set Output Data **/
#define PIOB_PIO_SODR_P13		(1 << 13)
/** PIOB_PIO_SODR_P12 Set Output Data **/
#define PIOB_PIO_SODR_P12		(1 << 12)
/** PIOB_PIO_SODR_P11 Set Output Data **/
#define PIOB_PIO_SODR_P11		(1 << 11)
/** PIOB_PIO_SODR_P10 Set Output Data **/
#define PIOB_PIO_SODR_P10		(1 << 10)
/** PIOB_PIO_SODR_P9 Set Output Data **/
#define PIOB_PIO_SODR_P9		(1 << 9)
/** PIOB_PIO_SODR_P8 Set Output Data **/
#define PIOB_PIO_SODR_P8		(1 << 8)
/** PIOB_PIO_SODR_P7 Set Output Data **/
#define PIOB_PIO_SODR_P7		(1 << 7)
/** PIOB_PIO_SODR_P6 Set Output Data **/
#define PIOB_PIO_SODR_P6		(1 << 6)
/** PIOB_PIO_SODR_P5 Set Output Data **/
#define PIOB_PIO_SODR_P5		(1 << 5)
/** PIOB_PIO_SODR_P4 Set Output Data **/
#define PIOB_PIO_SODR_P4		(1 << 4)
/** PIOB_PIO_SODR_P3 Set Output Data **/
#define PIOB_PIO_SODR_P3		(1 << 3)
/** PIOB_PIO_SODR_P2 Set Output Data **/
#define PIOB_PIO_SODR_P2		(1 << 2)
/** PIOB_PIO_SODR_P1 Set Output Data **/
#define PIOB_PIO_SODR_P1		(1 << 1)
/** PIOB_PIO_SODR_P0 Set Output Data **/
#define PIOB_PIO_SODR_P0		(1 << 0)

/**@}*/

