grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_idr PIOIDR Interrupt Disable Register
@{*/

/** PIOB_PIO_IDR_P31 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P31		(1 << 31)
/** PIOB_PIO_IDR_P30 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P30		(1 << 30)
/** PIOB_PIO_IDR_P29 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P29		(1 << 29)
/** PIOB_PIO_IDR_P28 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P28		(1 << 28)
/** PIOB_PIO_IDR_P27 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P27		(1 << 27)
/** PIOB_PIO_IDR_P26 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P26		(1 << 26)
/** PIOB_PIO_IDR_P25 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P25		(1 << 25)
/** PIOB_PIO_IDR_P24 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P24		(1 << 24)
/** PIOB_PIO_IDR_P23 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P23		(1 << 23)
/** PIOB_PIO_IDR_P22 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P22		(1 << 22)
/** PIOB_PIO_IDR_P21 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P21		(1 << 21)
/** PIOB_PIO_IDR_P20 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P20		(1 << 20)
/** PIOB_PIO_IDR_P19 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P19		(1 << 19)
/** PIOB_PIO_IDR_P18 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P18		(1 << 18)
/** PIOB_PIO_IDR_P17 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P17		(1 << 17)
/** PIOB_PIO_IDR_P16 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P16		(1 << 16)
/** PIOB_PIO_IDR_P15 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P15		(1 << 15)
/** PIOB_PIO_IDR_P14 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P14		(1 << 14)
/** PIOB_PIO_IDR_P13 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P13		(1 << 13)
/** PIOB_PIO_IDR_P12 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P12		(1 << 12)
/** PIOB_PIO_IDR_P11 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P11		(1 << 11)
/** PIOB_PIO_IDR_P10 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P10		(1 << 10)
/** PIOB_PIO_IDR_P9 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P9		(1 << 9)
/** PIOB_PIO_IDR_P8 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P8		(1 << 8)
/** PIOB_PIO_IDR_P7 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P7		(1 << 7)
/** PIOB_PIO_IDR_P6 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P6		(1 << 6)
/** PIOB_PIO_IDR_P5 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P5		(1 << 5)
/** PIOB_PIO_IDR_P4 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P4		(1 << 4)
/** PIOB_PIO_IDR_P3 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P3		(1 << 3)
/** PIOB_PIO_IDR_P2 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P2		(1 << 2)
/** PIOB_PIO_IDR_P1 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P1		(1 << 1)
/** PIOB_PIO_IDR_P0 Input Change Interrupt Disable **/
#define PIOB_PIO_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_imr PIOIMR Interrupt Mask Register
@{*/

/** PIOB_PIO_IMR_P31 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P31		(1 << 31)
/** PIOB_PIO_IMR_P30 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P30		(1 << 30)
/** PIOB_PIO_IMR_P29 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P29		(1 << 29)
/** PIOB_PIO_IMR_P28 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P28		(1 << 28)
/** PIOB_PIO_IMR_P27 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P27		(1 << 27)
/** PIOB_PIO_IMR_P26 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P26		(1 << 26)
/** PIOB_PIO_IMR_P25 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P25		(1 << 25)
/** PIOB_PIO_IMR_P24 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P24		(1 << 24)
/** PIOB_PIO_IMR_P23 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P23		(1 << 23)
/** PIOB_PIO_IMR_P22 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P22		(1 << 22)
/** PIOB_PIO_IMR_P21 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P21		(1 << 21)
/** PIOB_PIO_IMR_P20 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P20		(1 << 20)
/** PIOB_PIO_IMR_P19 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P19		(1 << 19)
/** PIOB_PIO_IMR_P18 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P18		(1 << 18)
/** PIOB_PIO_IMR_P17 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P17		(1 << 17)
/** PIOB_PIO_IMR_P16 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P16		(1 << 16)
/** PIOB_PIO_IMR_P15 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P15		(1 << 15)
/** PIOB_PIO_IMR_P14 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P14		(1 << 14)
/** PIOB_PIO_IMR_P13 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P13		(1 << 13)
/** PIOB_PIO_IMR_P12 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P12		(1 << 12)
/** PIOB_PIO_IMR_P11 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P11		(1 << 11)
/** PIOB_PIO_IMR_P10 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P10		(1 << 10)
/** PIOB_PIO_IMR_P9 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P9		(1 << 9)
/** PIOB_PIO_IMR_P8 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P8		(1 << 8)
/** PIOB_PIO_IMR_P7 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P7		(1 << 7)
/** PIOB_PIO_IMR_P6 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P6		(1 << 6)
/** PIOB_PIO_IMR_P5 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P5		(1 << 5)
/** PIOB_PIO_IMR_P4 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P4		(1 << 4)
/** PIOB_PIO_IMR_P3 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P3		(1 << 3)
/** PIOB_PIO_IMR_P2 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P2		(1 << 2)
/** PIOB_PIO_IMR_P1 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P1		(1 << 1)
/** PIOB_PIO_IMR_P0 Input Change Interrupt Mask **/
#define PIOB_PIO_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_isr PIOISR Interrupt Status Register
@{*/

/** PIOB_PIO_ISR_P31 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P31		(1 << 31)
/** PIOB_PIO_ISR_P30 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P30		(1 << 30)
/** PIOB_PIO_ISR_P29 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P29		(1 << 29)
/** PIOB_PIO_ISR_P28 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P28		(1 << 28)
/** PIOB_PIO_ISR_P27 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P27		(1 << 27)
/** PIOB_PIO_ISR_P26 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P26		(1 << 26)
/** PIOB_PIO_ISR_P25 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P25		(1 << 25)
/** PIOB_PIO_ISR_P24 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P24		(1 << 24)
/** PIOB_PIO_ISR_P23 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P23		(1 << 23)
/** PIOB_PIO_ISR_P22 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P22		(1 << 22)
/** PIOB_PIO_ISR_P21 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P21		(1 << 21)
/** PIOB_PIO_ISR_P20 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P20		(1 << 20)
/** PIOB_PIO_ISR_P19 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P19		(1 << 19)
/** PIOB_PIO_ISR_P18 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P18		(1 << 18)
/** PIOB_PIO_ISR_P17 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P17		(1 << 17)
/** PIOB_PIO_ISR_P16 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P16		(1 << 16)
/** PIOB_PIO_ISR_P15 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P15		(1 << 15)
/** PIOB_PIO_ISR_P14 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P14		(1 << 14)
/** PIOB_PIO_ISR_P13 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P13		(1 << 13)
/** PIOB_PIO_ISR_P12 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P12		(1 << 12)
/** PIOB_PIO_ISR_P11 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P11		(1 << 11)
/** PIOB_PIO_ISR_P10 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P10		(1 << 10)
/** PIOB_PIO_ISR_P9 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P9		(1 << 9)
/** PIOB_PIO_ISR_P8 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P8		(1 << 8)
/** PIOB_PIO_ISR_P7 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P7		(1 << 7)
/** PIOB_PIO_ISR_P6 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P6		(1 << 6)
/** PIOB_PIO_ISR_P5 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P5		(1 << 5)
/** PIOB_PIO_ISR_P4 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P4		(1 << 4)
/** PIOB_PIO_ISR_P3 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P3		(1 << 3)
/** PIOB_PIO_ISR_P2 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P2		(1 << 2)
/** PIOB_PIO_ISR_P1 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P1		(1 << 1)
/** PIOB_PIO_ISR_P0 Input Change Interrupt Status **/
#define PIOB_PIO_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_mder PIOMDER Multi-driver Enable Register
@{*/

/** PIOB_PIO_MDER_P31 Multi-drive Enable **/
#define PIOB_PIO_MDER_P31		(1 << 31)
/** PIOB_PIO_MDER_P30 Multi-drive Enable **/
#define PIOB_PIO_MDER_P30		(1 << 30)
/** PIOB_PIO_MDER_P29 Multi-drive Enable **/
#define PIOB_PIO_MDER_P29		(1 << 29)
/** PIOB_PIO_MDER_P28 Multi-drive Enable **/
#define PIOB_PIO_MDER_P28		(1 << 28)
/** PIOB_PIO_MDER_P27 Multi-drive Enable **/
#define PIOB_PIO_MDER_P27		(1 << 27)
/** PIOB_PIO_MDER_P26 Multi-drive Enable **/
#define PIOB_PIO_MDER_P26		(1 << 26)
/** PIOB_PIO_MDER_P25 Multi-drive Enable **/
#define PIOB_PIO_MDER_P25		(1 << 25)
/** PIOB_PIO_MDER_P24 Multi-drive Enable **/
#define PIOB_PIO_MDER_P24		(1 << 24)
/** PIOB_PIO_MDER_P23 Multi-drive Enable **/
#define PIOB_PIO_MDER_P23		(1 << 23)
/** PIOB_PIO_MDER_P22 Multi-drive Enable **/
#define PIOB_PIO_MDER_P22		(1 << 22)
/** PIOB_PIO_MDER_P21 Multi-drive Enable **/
#define PIOB_PIO_MDER_P21		(1 << 21)
/** PIOB_PIO_MDER_P20 Multi-drive Enable **/
#define PIOB_PIO_MDER_P20		(1 << 20)
/** PIOB_PIO_MDER_P19 Multi-drive Enable **/
#define PIOB_PIO_MDER_P19		(1 << 19)
/** PIOB_PIO_MDER_P18 Multi-drive Enable **/
#define PIOB_PIO_MDER_P18		(1 << 18)
/** PIOB_PIO_MDER_P17 Multi-drive Enable **/
#define PIOB_PIO_MDER_P17		(1 << 17)
/** PIOB_PIO_MDER_P16 Multi-drive Enable **/
#define PIOB_PIO_MDER_P16		(1 << 16)
/** PIOB_PIO_MDER_P15 Multi-drive Enable **/
#define PIOB_PIO_MDER_P15		(1 << 15)
/** PIOB_PIO_MDER_P14 Multi-drive Enable **/
#define PIOB_PIO_MDER_P14		(1 << 14)
/** PIOB_PIO_MDER_P13 Multi-drive Enable **/
#define PIOB_PIO_MDER_P13		(1 << 13)
/** PIOB_PIO_MDER_P12 Multi-drive Enable **/
#define PIOB_PIO_MDER_P12		(1 << 12)
/** PIOB_PIO_MDER_P11 Multi-drive Enable **/
#define PIOB_PIO_MDER_P11		(1 << 11)
/** PIOB_PIO_MDER_P10 Multi-drive Enable **/
#define PIOB_PIO_MDER_P10		(1 << 10)
/** PIOB_PIO_MDER_P9 Multi-drive Enable **/
#define PIOB_PIO_MDER_P9		(1 << 9)
/** PIOB_PIO_MDER_P8 Multi-drive Enable **/
#define PIOB_PIO_MDER_P8		(1 << 8)
/** PIOB_PIO_MDER_P7 Multi-drive Enable **/
#define PIOB_PIO_MDER_P7		(1 << 7)
/** PIOB_PIO_MDER_P6 Multi-drive Enable **/
#define PIOB_PIO_MDER_P6		(1 << 6)
/** PIOB_PIO_MDER_P5 Multi-drive Enable **/
#define PIOB_PIO_MDER_P5		(1 << 5)
/** PIOB_PIO_MDER_P4 Multi-drive Enable **/
#define PIOB_PIO_MDER_P4		(1 << 4)
/** PIOB_PIO_MDER_P3 Multi-drive Enable **/
#define PIOB_PIO_MDER_P3		(1 << 3)
/** PIOB_PIO_MDER_P2 Multi-drive Enable **/
#define PIOB_PIO_MDER_P2		(1 << 2)
/** PIOB_PIO_MDER_P1 Multi-drive Enable **/
#define PIOB_PIO_MDER_P1		(1 << 1)
/** PIOB_PIO_MDER_P0 Multi-drive Enable **/
#define PIOB_PIO_MDER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_mddr PIOMDDR Multi-driver Disable Register
@{*/

/** PIOB_PIO_MDDR_P31 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P31		(1 << 31)
/** PIOB_PIO_MDDR_P30 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P30		(1 << 30)
/** PIOB_PIO_MDDR_P29 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P29		(1 << 29)
/** PIOB_PIO_MDDR_P28 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P28		(1 << 28)
/** PIOB_PIO_MDDR_P27 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P27		(1 << 27)
/** PIOB_PIO_MDDR_P26 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P26		(1 << 26)
/** PIOB_PIO_MDDR_P25 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P25		(1 << 25)
/** PIOB_PIO_MDDR_P24 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P24		(1 << 24)
/** PIOB_PIO_MDDR_P23 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P23		(1 << 23)
/** PIOB_PIO_MDDR_P22 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P22		(1 << 22)
/** PIOB_PIO_MDDR_P21 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P21		(1 << 21)
/** PIOB_PIO_MDDR_P20 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P20		(1 << 20)
/** PIOB_PIO_MDDR_P19 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P19		(1 << 19)
/** PIOB_PIO_MDDR_P18 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P18		(1 << 18)
/** PIOB_PIO_MDDR_P17 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P17		(1 << 17)
/** PIOB_PIO_MDDR_P16 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P16		(1 << 16)
/** PIOB_PIO_MDDR_P15 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P15		(1 << 15)
/** PIOB_PIO_MDDR_P14 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P14		(1 << 14)
/** PIOB_PIO_MDDR_P13 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P13		(1 << 13)
/** PIOB_PIO_MDDR_P12 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P12		(1 << 12)
/** PIOB_PIO_MDDR_P11 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P11		(1 << 11)
/** PIOB_PIO_MDDR_P10 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P10		(1 << 10)
/** PIOB_PIO_MDDR_P9 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P9		(1 << 9)
/** PIOB_PIO_MDDR_P8 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P8		(1 << 8)
/** PIOB_PIO_MDDR_P7 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P7		(1 << 7)
/** PIOB_PIO_MDDR_P6 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P6		(1 << 6)
/** PIOB_PIO_MDDR_P5 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P5		(1 << 5)
/** PIOB_PIO_MDDR_P4 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P4		(1 << 4)
/** PIOB_PIO_MDDR_P3 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P3		(1 << 3)
/** PIOB_PIO_MDDR_P2 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P2		(1 << 2)
/** PIOB_PIO_MDDR_P1 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P1		(1 << 1)
/** PIOB_PIO_MDDR_P0 Multi-drive Disable **/
#define PIOB_PIO_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_mdsr PIOMDSR Multi-driver Status Register
@{*/

