grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_pusr PIOPUSR Pad Pull-up Status Register
@{*/

/** PIOB_PIO_PUSR_P31 Pull-Up Status **/
#define PIOB_PIO_PUSR_P31		(1 << 31)
/** PIOB_PIO_PUSR_P30 Pull-Up Status **/
#define PIOB_PIO_PUSR_P30		(1 << 30)
/** PIOB_PIO_PUSR_P29 Pull-Up Status **/
#define PIOB_PIO_PUSR_P29		(1 << 29)
/** PIOB_PIO_PUSR_P28 Pull-Up Status **/
#define PIOB_PIO_PUSR_P28		(1 << 28)
/** PIOB_PIO_PUSR_P27 Pull-Up Status **/
#define PIOB_PIO_PUSR_P27		(1 << 27)
/** PIOB_PIO_PUSR_P26 Pull-Up Status **/
#define PIOB_PIO_PUSR_P26		(1 << 26)
/** PIOB_PIO_PUSR_P25 Pull-Up Status **/
#define PIOB_PIO_PUSR_P25		(1 << 25)
/** PIOB_PIO_PUSR_P24 Pull-Up Status **/
#define PIOB_PIO_PUSR_P24		(1 << 24)
/** PIOB_PIO_PUSR_P23 Pull-Up Status **/
#define PIOB_PIO_PUSR_P23		(1 << 23)
/** PIOB_PIO_PUSR_P22 Pull-Up Status **/
#define PIOB_PIO_PUSR_P22		(1 << 22)
/** PIOB_PIO_PUSR_P21 Pull-Up Status **/
#define PIOB_PIO_PUSR_P21		(1 << 21)
/** PIOB_PIO_PUSR_P20 Pull-Up Status **/
#define PIOB_PIO_PUSR_P20		(1 << 20)
/** PIOB_PIO_PUSR_P19 Pull-Up Status **/
#define PIOB_PIO_PUSR_P19		(1 << 19)
/** PIOB_PIO_PUSR_P18 Pull-Up Status **/
#define PIOB_PIO_PUSR_P18		(1 << 18)
/** PIOB_PIO_PUSR_P17 Pull-Up Status **/
#define PIOB_PIO_PUSR_P17		(1 << 17)
/** PIOB_PIO_PUSR_P16 Pull-Up Status **/
#define PIOB_PIO_PUSR_P16		(1 << 16)
/** PIOB_PIO_PUSR_P15 Pull-Up Status **/
#define PIOB_PIO_PUSR_P15		(1 << 15)
/** PIOB_PIO_PUSR_P14 Pull-Up Status **/
#define PIOB_PIO_PUSR_P14		(1 << 14)
/** PIOB_PIO_PUSR_P13 Pull-Up Status **/
#define PIOB_PIO_PUSR_P13		(1 << 13)
/** PIOB_PIO_PUSR_P12 Pull-Up Status **/
#define PIOB_PIO_PUSR_P12		(1 << 12)
/** PIOB_PIO_PUSR_P11 Pull-Up Status **/
#define PIOB_PIO_PUSR_P11		(1 << 11)
/** PIOB_PIO_PUSR_P10 Pull-Up Status **/
#define PIOB_PIO_PUSR_P10		(1 << 10)
/** PIOB_PIO_PUSR_P9 Pull-Up Status **/
#define PIOB_PIO_PUSR_P9		(1 << 9)
/** PIOB_PIO_PUSR_P8 Pull-Up Status **/
#define PIOB_PIO_PUSR_P8		(1 << 8)
/** PIOB_PIO_PUSR_P7 Pull-Up Status **/
#define PIOB_PIO_PUSR_P7		(1 << 7)
/** PIOB_PIO_PUSR_P6 Pull-Up Status **/
#define PIOB_PIO_PUSR_P6		(1 << 6)
/** PIOB_PIO_PUSR_P5 Pull-Up Status **/
#define PIOB_PIO_PUSR_P5		(1 << 5)
/** PIOB_PIO_PUSR_P4 Pull-Up Status **/
#define PIOB_PIO_PUSR_P4		(1 << 4)
/** PIOB_PIO_PUSR_P3 Pull-Up Status **/
#define PIOB_PIO_PUSR_P3		(1 << 3)
/** PIOB_PIO_PUSR_P2 Pull-Up Status **/
#define PIOB_PIO_PUSR_P2		(1 << 2)
/** PIOB_PIO_PUSR_P1 Pull-Up Status **/
#define PIOB_PIO_PUSR_P1		(1 << 1)
/** PIOB_PIO_PUSR_P0 Pull-Up Status **/
#define PIOB_PIO_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_abcdsr[0] PIOABCDSR[0] Peripheral ABCD Select Register 0
@{*/

/** PIOB_PIO_ABCDSR[0]_P31 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P31		(1 << 31)
/** PIOB_PIO_ABCDSR[0]_P30 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P30		(1 << 30)
/** PIOB_PIO_ABCDSR[0]_P29 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P29		(1 << 29)
/** PIOB_PIO_ABCDSR[0]_P28 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P28		(1 << 28)
/** PIOB_PIO_ABCDSR[0]_P27 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P27		(1 << 27)
/** PIOB_PIO_ABCDSR[0]_P26 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P26		(1 << 26)
/** PIOB_PIO_ABCDSR[0]_P25 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P25		(1 << 25)
/** PIOB_PIO_ABCDSR[0]_P24 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P24		(1 << 24)
/** PIOB_PIO_ABCDSR[0]_P23 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P23		(1 << 23)
/** PIOB_PIO_ABCDSR[0]_P22 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P22		(1 << 22)
/** PIOB_PIO_ABCDSR[0]_P21 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P21		(1 << 21)
/** PIOB_PIO_ABCDSR[0]_P20 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P20		(1 << 20)
/** PIOB_PIO_ABCDSR[0]_P19 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P19		(1 << 19)
/** PIOB_PIO_ABCDSR[0]_P18 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P18		(1 << 18)
/** PIOB_PIO_ABCDSR[0]_P17 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P17		(1 << 17)
/** PIOB_PIO_ABCDSR[0]_P16 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P16		(1 << 16)
/** PIOB_PIO_ABCDSR[0]_P15 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P15		(1 << 15)
/** PIOB_PIO_ABCDSR[0]_P14 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P14		(1 << 14)
/** PIOB_PIO_ABCDSR[0]_P13 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P13		(1 << 13)
/** PIOB_PIO_ABCDSR[0]_P12 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P12		(1 << 12)
/** PIOB_PIO_ABCDSR[0]_P11 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P11		(1 << 11)
/** PIOB_PIO_ABCDSR[0]_P10 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P10		(1 << 10)
/** PIOB_PIO_ABCDSR[0]_P9 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P9		(1 << 9)
/** PIOB_PIO_ABCDSR[0]_P8 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P8		(1 << 8)
/** PIOB_PIO_ABCDSR[0]_P7 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P7		(1 << 7)
/** PIOB_PIO_ABCDSR[0]_P6 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P6		(1 << 6)
/** PIOB_PIO_ABCDSR[0]_P5 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P5		(1 << 5)
/** PIOB_PIO_ABCDSR[0]_P4 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P4		(1 << 4)
/** PIOB_PIO_ABCDSR[0]_P3 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P3		(1 << 3)
/** PIOB_PIO_ABCDSR[0]_P2 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P2		(1 << 2)
/** PIOB_PIO_ABCDSR[0]_P1 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P1		(1 << 1)
/** PIOB_PIO_ABCDSR[0]_P0 Peripheral Select **/
#define PIOB_PIO_ABCDSR[0]_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_abcdsr[1] PIOABCDSR[1] Peripheral ABCD Select Register 0
@{*/

/** PIOB_PIO_ABCDSR[1]_P31 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P31		(1 << 31)
/** PIOB_PIO_ABCDSR[1]_P30 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P30		(1 << 30)
/** PIOB_PIO_ABCDSR[1]_P29 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P29		(1 << 29)
/** PIOB_PIO_ABCDSR[1]_P28 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P28		(1 << 28)
/** PIOB_PIO_ABCDSR[1]_P27 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P27		(1 << 27)
/** PIOB_PIO_ABCDSR[1]_P26 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P26		(1 << 26)
/** PIOB_PIO_ABCDSR[1]_P25 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P25		(1 << 25)
/** PIOB_PIO_ABCDSR[1]_P24 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P24		(1 << 24)
/** PIOB_PIO_ABCDSR[1]_P23 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P23		(1 << 23)
/** PIOB_PIO_ABCDSR[1]_P22 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P22		(1 << 22)
/** PIOB_PIO_ABCDSR[1]_P21 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P21		(1 << 21)
/** PIOB_PIO_ABCDSR[1]_P20 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P20		(1 << 20)
/** PIOB_PIO_ABCDSR[1]_P19 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P19		(1 << 19)
/** PIOB_PIO_ABCDSR[1]_P18 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P18		(1 << 18)
/** PIOB_PIO_ABCDSR[1]_P17 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P17		(1 << 17)
/** PIOB_PIO_ABCDSR[1]_P16 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P16		(1 << 16)
/** PIOB_PIO_ABCDSR[1]_P15 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P15		(1 << 15)
/** PIOB_PIO_ABCDSR[1]_P14 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P14		(1 << 14)
/** PIOB_PIO_ABCDSR[1]_P13 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P13		(1 << 13)
/** PIOB_PIO_ABCDSR[1]_P12 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P12		(1 << 12)
/** PIOB_PIO_ABCDSR[1]_P11 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P11		(1 << 11)
/** PIOB_PIO_ABCDSR[1]_P10 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P10		(1 << 10)
/** PIOB_PIO_ABCDSR[1]_P9 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P9		(1 << 9)
/** PIOB_PIO_ABCDSR[1]_P8 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P8		(1 << 8)
/** PIOB_PIO_ABCDSR[1]_P7 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P7		(1 << 7)
/** PIOB_PIO_ABCDSR[1]_P6 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P6		(1 << 6)
/** PIOB_PIO_ABCDSR[1]_P5 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P5		(1 << 5)
/** PIOB_PIO_ABCDSR[1]_P4 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P4		(1 << 4)
/** PIOB_PIO_ABCDSR[1]_P3 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P3		(1 << 3)
/** PIOB_PIO_ABCDSR[1]_P2 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P2		(1 << 2)
/** PIOB_PIO_ABCDSR[1]_P1 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P1		(1 << 1)
/** PIOB_PIO_ABCDSR[1]_P0 Peripheral Select **/
#define PIOB_PIO_ABCDSR[1]_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifscdr PIOIFSCDR Input Filter Slow Clock Disable Register
@{*/

/** PIOB_PIO_IFSCDR_P31 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P31		(1 << 31)
/** PIOB_PIO_IFSCDR_P30 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P30		(1 << 30)
/** PIOB_PIO_IFSCDR_P29 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P29		(1 << 29)
/** PIOB_PIO_IFSCDR_P28 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P28		(1 << 28)
/** PIOB_PIO_IFSCDR_P27 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P27		(1 << 27)
/** PIOB_PIO_IFSCDR_P26 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P26		(1 << 26)
/** PIOB_PIO_IFSCDR_P25 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P25		(1 << 25)
/** PIOB_PIO_IFSCDR_P24 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P24		(1 << 24)
/** PIOB_PIO_IFSCDR_P23 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P23		(1 << 23)
/** PIOB_PIO_IFSCDR_P22 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P22		(1 << 22)
/** PIOB_PIO_IFSCDR_P21 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P21		(1 << 21)
/** PIOB_PIO_IFSCDR_P20 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P20		(1 << 20)
/** PIOB_PIO_IFSCDR_P19 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P19		(1 << 19)
/** PIOB_PIO_IFSCDR_P18 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P18		(1 << 18)
/** PIOB_PIO_IFSCDR_P17 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P17		(1 << 17)
/** PIOB_PIO_IFSCDR_P16 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P16		(1 << 16)
/** PIOB_PIO_IFSCDR_P15 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P15		(1 << 15)
/** PIOB_PIO_IFSCDR_P14 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P14		(1 << 14)
/** PIOB_PIO_IFSCDR_P13 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P13		(1 << 13)
/** PIOB_PIO_IFSCDR_P12 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P12		(1 << 12)
/** PIOB_PIO_IFSCDR_P11 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P11		(1 << 11)
/** PIOB_PIO_IFSCDR_P10 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P10		(1 << 10)
/** PIOB_PIO_IFSCDR_P9 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P9		(1 << 9)
/** PIOB_PIO_IFSCDR_P8 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P8		(1 << 8)
/** PIOB_PIO_IFSCDR_P7 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P7		(1 << 7)
/** PIOB_PIO_IFSCDR_P6 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P6		(1 << 6)
/** PIOB_PIO_IFSCDR_P5 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P5		(1 << 5)
/** PIOB_PIO_IFSCDR_P4 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P4		(1 << 4)
/** PIOB_PIO_IFSCDR_P3 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P3		(1 << 3)
/** PIOB_PIO_IFSCDR_P2 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P2		(1 << 2)
/** PIOB_PIO_IFSCDR_P1 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P1		(1 << 1)
/** PIOB_PIO_IFSCDR_P0 Peripheral Clock Glitch Filtering Select **/
#define PIOB_PIO_IFSCDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifscer PIOIFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOB_PIO_IFSCER_P31 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P31		(1 << 31)
/** PIOB_PIO_IFSCER_P30 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P30		(1 << 30)
/** PIOB_PIO_IFSCER_P29 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P29		(1 << 29)
/** PIOB_PIO_IFSCER_P28 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P28		(1 << 28)
/** PIOB_PIO_IFSCER_P27 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P27		(1 << 27)
/** PIOB_PIO_IFSCER_P26 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P26		(1 << 26)
/** PIOB_PIO_IFSCER_P25 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P25		(1 << 25)
/** PIOB_PIO_IFSCER_P24 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P24		(1 << 24)
/** PIOB_PIO_IFSCER_P23 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P23		(1 << 23)
/** PIOB_PIO_IFSCER_P22 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P22		(1 << 22)
/** PIOB_PIO_IFSCER_P21 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P21		(1 << 21)
/** PIOB_PIO_IFSCER_P20 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P20		(1 << 20)
/** PIOB_PIO_IFSCER_P19 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P19		(1 << 19)
/** PIOB_PIO_IFSCER_P18 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P18		(1 << 18)
/** PIOB_PIO_IFSCER_P17 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P17		(1 << 17)
/** PIOB_PIO_IFSCER_P16 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P16		(1 << 16)
/** PIOB_PIO_IFSCER_P15 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P15		(1 << 15)
/** PIOB_PIO_IFSCER_P14 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P14		(1 << 14)
/** PIOB_PIO_IFSCER_P13 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P13		(1 << 13)
/** PIOB_PIO_IFSCER_P12 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P12		(1 << 12)
/** PIOB_PIO_IFSCER_P11 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P11		(1 << 11)
/** PIOB_PIO_IFSCER_P10 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P10		(1 << 10)
/** PIOB_PIO_IFSCER_P9 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P9		(1 << 9)
/** PIOB_PIO_IFSCER_P8 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P8		(1 << 8)
/** PIOB_PIO_IFSCER_P7 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P7		(1 << 7)
/** PIOB_PIO_IFSCER_P6 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P6		(1 << 6)
/** PIOB_PIO_IFSCER_P5 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P5		(1 << 5)
/** PIOB_PIO_IFSCER_P4 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P4		(1 << 4)
/** PIOB_PIO_IFSCER_P3 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P3		(1 << 3)
/** PIOB_PIO_IFSCER_P2 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P2		(1 << 2)
/** PIOB_PIO_IFSCER_P1 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P1		(1 << 1)
/** PIOB_PIO_IFSCER_P0 Slow Clock Debouncing Filtering Select **/
#define PIOB_PIO_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ifscsr PIOIFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOB_PIO_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P31		(1 << 31)
/** PIOB_PIO_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P30		(1 << 30)
/** PIOB_PIO_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P29		(1 << 29)
/** PIOB_PIO_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P28		(1 << 28)
/** PIOB_PIO_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P27		(1 << 27)
/** PIOB_PIO_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P26		(1 << 26)
/** PIOB_PIO_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P25		(1 << 25)
/** PIOB_PIO_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P24		(1 << 24)
/** PIOB_PIO_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P23		(1 << 23)
/** PIOB_PIO_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P22		(1 << 22)
/** PIOB_PIO_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P21		(1 << 21)
/** PIOB_PIO_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P20		(1 << 20)
/** PIOB_PIO_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P19		(1 << 19)
/** PIOB_PIO_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P18		(1 << 18)
/** PIOB_PIO_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P17		(1 << 17)
/** PIOB_PIO_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P16		(1 << 16)
/** PIOB_PIO_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P15		(1 << 15)
/** PIOB_PIO_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P14		(1 << 14)
/** PIOB_PIO_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P13		(1 << 13)
/** PIOB_PIO_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P12		(1 << 12)
/** PIOB_PIO_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P11		(1 << 11)
/** PIOB_PIO_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P10		(1 << 10)
/** PIOB_PIO_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P9		(1 << 9)
/** PIOB_PIO_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P8		(1 << 8)
/** PIOB_PIO_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P7		(1 << 7)
/** PIOB_PIO_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P6		(1 << 6)
/** PIOB_PIO_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P5		(1 << 5)
/** PIOB_PIO_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P4		(1 << 4)
/** PIOB_PIO_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P3		(1 << 3)
/** PIOB_PIO_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P2		(1 << 2)
/** PIOB_PIO_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P1		(1 << 1)
/** PIOB_PIO_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOB_PIO_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_scdr PIOSCDR Slow Clock Divider Debouncing Register
@{*/


