grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_aimmr PIOAIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOB_PIO_AIMMR_P31 IO Line Index **/
#define PIOB_PIO_AIMMR_P31		(1 << 31)
/** PIOB_PIO_AIMMR_P30 IO Line Index **/
#define PIOB_PIO_AIMMR_P30		(1 << 30)
/** PIOB_PIO_AIMMR_P29 IO Line Index **/
#define PIOB_PIO_AIMMR_P29		(1 << 29)
/** PIOB_PIO_AIMMR_P28 IO Line Index **/
#define PIOB_PIO_AIMMR_P28		(1 << 28)
/** PIOB_PIO_AIMMR_P27 IO Line Index **/
#define PIOB_PIO_AIMMR_P27		(1 << 27)
/** PIOB_PIO_AIMMR_P26 IO Line Index **/
#define PIOB_PIO_AIMMR_P26		(1 << 26)
/** PIOB_PIO_AIMMR_P25 IO Line Index **/
#define PIOB_PIO_AIMMR_P25		(1 << 25)
/** PIOB_PIO_AIMMR_P24 IO Line Index **/
#define PIOB_PIO_AIMMR_P24		(1 << 24)
/** PIOB_PIO_AIMMR_P23 IO Line Index **/
#define PIOB_PIO_AIMMR_P23		(1 << 23)
/** PIOB_PIO_AIMMR_P22 IO Line Index **/
#define PIOB_PIO_AIMMR_P22		(1 << 22)
/** PIOB_PIO_AIMMR_P21 IO Line Index **/
#define PIOB_PIO_AIMMR_P21		(1 << 21)
/** PIOB_PIO_AIMMR_P20 IO Line Index **/
#define PIOB_PIO_AIMMR_P20		(1 << 20)
/** PIOB_PIO_AIMMR_P19 IO Line Index **/
#define PIOB_PIO_AIMMR_P19		(1 << 19)
/** PIOB_PIO_AIMMR_P18 IO Line Index **/
#define PIOB_PIO_AIMMR_P18		(1 << 18)
/** PIOB_PIO_AIMMR_P17 IO Line Index **/
#define PIOB_PIO_AIMMR_P17		(1 << 17)
/** PIOB_PIO_AIMMR_P16 IO Line Index **/
#define PIOB_PIO_AIMMR_P16		(1 << 16)
/** PIOB_PIO_AIMMR_P15 IO Line Index **/
#define PIOB_PIO_AIMMR_P15		(1 << 15)
/** PIOB_PIO_AIMMR_P14 IO Line Index **/
#define PIOB_PIO_AIMMR_P14		(1 << 14)
/** PIOB_PIO_AIMMR_P13 IO Line Index **/
#define PIOB_PIO_AIMMR_P13		(1 << 13)
/** PIOB_PIO_AIMMR_P12 IO Line Index **/
#define PIOB_PIO_AIMMR_P12		(1 << 12)
/** PIOB_PIO_AIMMR_P11 IO Line Index **/
#define PIOB_PIO_AIMMR_P11		(1 << 11)
/** PIOB_PIO_AIMMR_P10 IO Line Index **/
#define PIOB_PIO_AIMMR_P10		(1 << 10)
/** PIOB_PIO_AIMMR_P9 IO Line Index **/
#define PIOB_PIO_AIMMR_P9		(1 << 9)
/** PIOB_PIO_AIMMR_P8 IO Line Index **/
#define PIOB_PIO_AIMMR_P8		(1 << 8)
/** PIOB_PIO_AIMMR_P7 IO Line Index **/
#define PIOB_PIO_AIMMR_P7		(1 << 7)
/** PIOB_PIO_AIMMR_P6 IO Line Index **/
#define PIOB_PIO_AIMMR_P6		(1 << 6)
/** PIOB_PIO_AIMMR_P5 IO Line Index **/
#define PIOB_PIO_AIMMR_P5		(1 << 5)
/** PIOB_PIO_AIMMR_P4 IO Line Index **/
#define PIOB_PIO_AIMMR_P4		(1 << 4)
/** PIOB_PIO_AIMMR_P3 IO Line Index **/
#define PIOB_PIO_AIMMR_P3		(1 << 3)
/** PIOB_PIO_AIMMR_P2 IO Line Index **/
#define PIOB_PIO_AIMMR_P2		(1 << 2)
/** PIOB_PIO_AIMMR_P1 IO Line Index **/
#define PIOB_PIO_AIMMR_P1		(1 << 1)
/** PIOB_PIO_AIMMR_P0 IO Line Index **/
#define PIOB_PIO_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_esr PIOESR Edge Select Register
@{*/

/** PIOB_PIO_ESR_P31 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P31		(1 << 31)
/** PIOB_PIO_ESR_P30 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P30		(1 << 30)
/** PIOB_PIO_ESR_P29 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P29		(1 << 29)
/** PIOB_PIO_ESR_P28 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P28		(1 << 28)
/** PIOB_PIO_ESR_P27 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P27		(1 << 27)
/** PIOB_PIO_ESR_P26 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P26		(1 << 26)
/** PIOB_PIO_ESR_P25 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P25		(1 << 25)
/** PIOB_PIO_ESR_P24 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P24		(1 << 24)
/** PIOB_PIO_ESR_P23 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P23		(1 << 23)
/** PIOB_PIO_ESR_P22 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P22		(1 << 22)
/** PIOB_PIO_ESR_P21 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P21		(1 << 21)
/** PIOB_PIO_ESR_P20 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P20		(1 << 20)
/** PIOB_PIO_ESR_P19 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P19		(1 << 19)
/** PIOB_PIO_ESR_P18 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P18		(1 << 18)
/** PIOB_PIO_ESR_P17 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P17		(1 << 17)
/** PIOB_PIO_ESR_P16 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P16		(1 << 16)
/** PIOB_PIO_ESR_P15 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P15		(1 << 15)
/** PIOB_PIO_ESR_P14 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P14		(1 << 14)
/** PIOB_PIO_ESR_P13 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P13		(1 << 13)
/** PIOB_PIO_ESR_P12 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P12		(1 << 12)
/** PIOB_PIO_ESR_P11 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P11		(1 << 11)
/** PIOB_PIO_ESR_P10 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P10		(1 << 10)
/** PIOB_PIO_ESR_P9 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P9		(1 << 9)
/** PIOB_PIO_ESR_P8 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P8		(1 << 8)
/** PIOB_PIO_ESR_P7 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P7		(1 << 7)
/** PIOB_PIO_ESR_P6 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P6		(1 << 6)
/** PIOB_PIO_ESR_P5 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P5		(1 << 5)
/** PIOB_PIO_ESR_P4 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P4		(1 << 4)
/** PIOB_PIO_ESR_P3 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P3		(1 << 3)
/** PIOB_PIO_ESR_P2 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P2		(1 << 2)
/** PIOB_PIO_ESR_P1 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P1		(1 << 1)
/** PIOB_PIO_ESR_P0 Edge Interrupt Selection **/
#define PIOB_PIO_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_lsr PIOLSR Level Select Register
@{*/

/** PIOB_PIO_LSR_P31 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P31		(1 << 31)
/** PIOB_PIO_LSR_P30 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P30		(1 << 30)
/** PIOB_PIO_LSR_P29 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P29		(1 << 29)
/** PIOB_PIO_LSR_P28 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P28		(1 << 28)
/** PIOB_PIO_LSR_P27 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P27		(1 << 27)
/** PIOB_PIO_LSR_P26 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P26		(1 << 26)
/** PIOB_PIO_LSR_P25 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P25		(1 << 25)
/** PIOB_PIO_LSR_P24 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P24		(1 << 24)
/** PIOB_PIO_LSR_P23 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P23		(1 << 23)
/** PIOB_PIO_LSR_P22 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P22		(1 << 22)
/** PIOB_PIO_LSR_P21 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P21		(1 << 21)
/** PIOB_PIO_LSR_P20 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P20		(1 << 20)
/** PIOB_PIO_LSR_P19 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P19		(1 << 19)
/** PIOB_PIO_LSR_P18 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P18		(1 << 18)
/** PIOB_PIO_LSR_P17 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P17		(1 << 17)
/** PIOB_PIO_LSR_P16 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P16		(1 << 16)
/** PIOB_PIO_LSR_P15 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P15		(1 << 15)
/** PIOB_PIO_LSR_P14 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P14		(1 << 14)
/** PIOB_PIO_LSR_P13 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P13		(1 << 13)
/** PIOB_PIO_LSR_P12 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P12		(1 << 12)
/** PIOB_PIO_LSR_P11 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P11		(1 << 11)
/** PIOB_PIO_LSR_P10 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P10		(1 << 10)
/** PIOB_PIO_LSR_P9 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P9		(1 << 9)
/** PIOB_PIO_LSR_P8 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P8		(1 << 8)
/** PIOB_PIO_LSR_P7 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P7		(1 << 7)
/** PIOB_PIO_LSR_P6 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P6		(1 << 6)
/** PIOB_PIO_LSR_P5 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P5		(1 << 5)
/** PIOB_PIO_LSR_P4 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P4		(1 << 4)
/** PIOB_PIO_LSR_P3 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P3		(1 << 3)
/** PIOB_PIO_LSR_P2 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P2		(1 << 2)
/** PIOB_PIO_LSR_P1 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P1		(1 << 1)
/** PIOB_PIO_LSR_P0 Level Interrupt Selection **/
#define PIOB_PIO_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_elsr PIOELSR Edge/Level Status Register
@{*/

/** PIOB_PIO_ELSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P31		(1 << 31)
/** PIOB_PIO_ELSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P30		(1 << 30)
/** PIOB_PIO_ELSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P29		(1 << 29)
/** PIOB_PIO_ELSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P28		(1 << 28)
/** PIOB_PIO_ELSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P27		(1 << 27)
/** PIOB_PIO_ELSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P26		(1 << 26)
/** PIOB_PIO_ELSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P25		(1 << 25)
/** PIOB_PIO_ELSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P24		(1 << 24)
/** PIOB_PIO_ELSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P23		(1 << 23)
/** PIOB_PIO_ELSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P22		(1 << 22)
/** PIOB_PIO_ELSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P21		(1 << 21)
/** PIOB_PIO_ELSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P20		(1 << 20)
/** PIOB_PIO_ELSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P19		(1 << 19)
/** PIOB_PIO_ELSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P18		(1 << 18)
/** PIOB_PIO_ELSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P17		(1 << 17)
/** PIOB_PIO_ELSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P16		(1 << 16)
/** PIOB_PIO_ELSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P15		(1 << 15)
/** PIOB_PIO_ELSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P14		(1 << 14)
/** PIOB_PIO_ELSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P13		(1 << 13)
/** PIOB_PIO_ELSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P12		(1 << 12)
/** PIOB_PIO_ELSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P11		(1 << 11)
/** PIOB_PIO_ELSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P10		(1 << 10)
/** PIOB_PIO_ELSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P9		(1 << 9)
/** PIOB_PIO_ELSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P8		(1 << 8)
/** PIOB_PIO_ELSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P7		(1 << 7)
/** PIOB_PIO_ELSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P6		(1 << 6)
/** PIOB_PIO_ELSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P5		(1 << 5)
/** PIOB_PIO_ELSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P4		(1 << 4)
/** PIOB_PIO_ELSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P3		(1 << 3)
/** PIOB_PIO_ELSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P2		(1 << 2)
/** PIOB_PIO_ELSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P1		(1 << 1)
/** PIOB_PIO_ELSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_ELSR_P0		(1 << 0)

/**@}*/

