grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_fellsr PIOFELLSR Falling Edge/Low-Level Select Register
@{*/

/** PIOB_PIO_FELLSR_P31 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P31		(1 << 31)
/** PIOB_PIO_FELLSR_P30 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P30		(1 << 30)
/** PIOB_PIO_FELLSR_P29 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P29		(1 << 29)
/** PIOB_PIO_FELLSR_P28 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P28		(1 << 28)
/** PIOB_PIO_FELLSR_P27 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P27		(1 << 27)
/** PIOB_PIO_FELLSR_P26 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P26		(1 << 26)
/** PIOB_PIO_FELLSR_P25 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P25		(1 << 25)
/** PIOB_PIO_FELLSR_P24 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P24		(1 << 24)
/** PIOB_PIO_FELLSR_P23 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P23		(1 << 23)
/** PIOB_PIO_FELLSR_P22 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P22		(1 << 22)
/** PIOB_PIO_FELLSR_P21 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P21		(1 << 21)
/** PIOB_PIO_FELLSR_P20 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P20		(1 << 20)
/** PIOB_PIO_FELLSR_P19 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P19		(1 << 19)
/** PIOB_PIO_FELLSR_P18 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P18		(1 << 18)
/** PIOB_PIO_FELLSR_P17 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P17		(1 << 17)
/** PIOB_PIO_FELLSR_P16 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P16		(1 << 16)
/** PIOB_PIO_FELLSR_P15 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P15		(1 << 15)
/** PIOB_PIO_FELLSR_P14 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P14		(1 << 14)
/** PIOB_PIO_FELLSR_P13 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P13		(1 << 13)
/** PIOB_PIO_FELLSR_P12 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P12		(1 << 12)
/** PIOB_PIO_FELLSR_P11 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P11		(1 << 11)
/** PIOB_PIO_FELLSR_P10 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P10		(1 << 10)
/** PIOB_PIO_FELLSR_P9 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P9		(1 << 9)
/** PIOB_PIO_FELLSR_P8 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P8		(1 << 8)
/** PIOB_PIO_FELLSR_P7 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P7		(1 << 7)
/** PIOB_PIO_FELLSR_P6 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P6		(1 << 6)
/** PIOB_PIO_FELLSR_P5 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P5		(1 << 5)
/** PIOB_PIO_FELLSR_P4 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P4		(1 << 4)
/** PIOB_PIO_FELLSR_P3 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P3		(1 << 3)
/** PIOB_PIO_FELLSR_P2 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P2		(1 << 2)
/** PIOB_PIO_FELLSR_P1 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P1		(1 << 1)
/** PIOB_PIO_FELLSR_P0 Falling Edge/Low-Level Interrupt Selection **/
#define PIOB_PIO_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_rehlsr PIOREHLSR Rising Edge/High-Level Select Register
@{*/

/** PIOB_PIO_REHLSR_P31 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P31		(1 << 31)
/** PIOB_PIO_REHLSR_P30 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P30		(1 << 30)
/** PIOB_PIO_REHLSR_P29 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P29		(1 << 29)
/** PIOB_PIO_REHLSR_P28 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P28		(1 << 28)
/** PIOB_PIO_REHLSR_P27 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P27		(1 << 27)
/** PIOB_PIO_REHLSR_P26 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P26		(1 << 26)
/** PIOB_PIO_REHLSR_P25 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P25		(1 << 25)
/** PIOB_PIO_REHLSR_P24 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P24		(1 << 24)
/** PIOB_PIO_REHLSR_P23 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P23		(1 << 23)
/** PIOB_PIO_REHLSR_P22 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P22		(1 << 22)
/** PIOB_PIO_REHLSR_P21 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P21		(1 << 21)
/** PIOB_PIO_REHLSR_P20 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P20		(1 << 20)
/** PIOB_PIO_REHLSR_P19 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P19		(1 << 19)
/** PIOB_PIO_REHLSR_P18 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P18		(1 << 18)
/** PIOB_PIO_REHLSR_P17 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P17		(1 << 17)
/** PIOB_PIO_REHLSR_P16 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P16		(1 << 16)
/** PIOB_PIO_REHLSR_P15 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P15		(1 << 15)
/** PIOB_PIO_REHLSR_P14 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P14		(1 << 14)
/** PIOB_PIO_REHLSR_P13 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P13		(1 << 13)
/** PIOB_PIO_REHLSR_P12 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P12		(1 << 12)
/** PIOB_PIO_REHLSR_P11 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P11		(1 << 11)
/** PIOB_PIO_REHLSR_P10 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P10		(1 << 10)
/** PIOB_PIO_REHLSR_P9 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P9		(1 << 9)
/** PIOB_PIO_REHLSR_P8 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P8		(1 << 8)
/** PIOB_PIO_REHLSR_P7 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P7		(1 << 7)
/** PIOB_PIO_REHLSR_P6 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P6		(1 << 6)
/** PIOB_PIO_REHLSR_P5 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P5		(1 << 5)
/** PIOB_PIO_REHLSR_P4 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P4		(1 << 4)
/** PIOB_PIO_REHLSR_P3 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P3		(1 << 3)
/** PIOB_PIO_REHLSR_P2 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P2		(1 << 2)
/** PIOB_PIO_REHLSR_P1 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P1		(1 << 1)
/** PIOB_PIO_REHLSR_P0 Rising Edge/High-Level Interrupt Selection **/
#define PIOB_PIO_REHLSR_P0		(1 << 0)

/**@}*/

