grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** @defgroup piob_pio_frlhsr PIOFRLHSR Fall/Rise - Low/High Status Register
@{*/

/** PIOB_PIO_FRLHSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P31		(1 << 31)
/** PIOB_PIO_FRLHSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P30		(1 << 30)
/** PIOB_PIO_FRLHSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P29		(1 << 29)
/** PIOB_PIO_FRLHSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P28		(1 << 28)
/** PIOB_PIO_FRLHSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P27		(1 << 27)
/** PIOB_PIO_FRLHSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P26		(1 << 26)
/** PIOB_PIO_FRLHSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P25		(1 << 25)
/** PIOB_PIO_FRLHSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P24		(1 << 24)
/** PIOB_PIO_FRLHSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P23		(1 << 23)
/** PIOB_PIO_FRLHSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P22		(1 << 22)
/** PIOB_PIO_FRLHSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P21		(1 << 21)
/** PIOB_PIO_FRLHSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P20		(1 << 20)
/** PIOB_PIO_FRLHSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P19		(1 << 19)
/** PIOB_PIO_FRLHSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P18		(1 << 18)
/** PIOB_PIO_FRLHSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P17		(1 << 17)
/** PIOB_PIO_FRLHSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P16		(1 << 16)
/** PIOB_PIO_FRLHSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P15		(1 << 15)
/** PIOB_PIO_FRLHSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P14		(1 << 14)
/** PIOB_PIO_FRLHSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P13		(1 << 13)
/** PIOB_PIO_FRLHSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P12		(1 << 12)
/** PIOB_PIO_FRLHSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P11		(1 << 11)
/** PIOB_PIO_FRLHSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P10		(1 << 10)
/** PIOB_PIO_FRLHSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P9		(1 << 9)
/** PIOB_PIO_FRLHSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P8		(1 << 8)
/** PIOB_PIO_FRLHSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P7		(1 << 7)
/** PIOB_PIO_FRLHSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P6		(1 << 6)
/** PIOB_PIO_FRLHSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P5		(1 << 5)
/** PIOB_PIO_FRLHSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P4		(1 << 4)
/** PIOB_PIO_FRLHSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P3		(1 << 3)
/** PIOB_PIO_FRLHSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P2		(1 << 2)
/** PIOB_PIO_FRLHSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P1		(1 << 1)
/** PIOB_PIO_FRLHSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOB_PIO_FRLHSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_locksr PIOLOCKSR Lock Status
@{*/

/** PIOB_PIO_LOCKSR_P31 Lock Status **/
#define PIOB_PIO_LOCKSR_P31		(1 << 31)
/** PIOB_PIO_LOCKSR_P30 Lock Status **/
#define PIOB_PIO_LOCKSR_P30		(1 << 30)
/** PIOB_PIO_LOCKSR_P29 Lock Status **/
#define PIOB_PIO_LOCKSR_P29		(1 << 29)
/** PIOB_PIO_LOCKSR_P28 Lock Status **/
#define PIOB_PIO_LOCKSR_P28		(1 << 28)
/** PIOB_PIO_LOCKSR_P27 Lock Status **/
#define PIOB_PIO_LOCKSR_P27		(1 << 27)
/** PIOB_PIO_LOCKSR_P26 Lock Status **/
#define PIOB_PIO_LOCKSR_P26		(1 << 26)
/** PIOB_PIO_LOCKSR_P25 Lock Status **/
#define PIOB_PIO_LOCKSR_P25		(1 << 25)
/** PIOB_PIO_LOCKSR_P24 Lock Status **/
#define PIOB_PIO_LOCKSR_P24		(1 << 24)
/** PIOB_PIO_LOCKSR_P23 Lock Status **/
#define PIOB_PIO_LOCKSR_P23		(1 << 23)
/** PIOB_PIO_LOCKSR_P22 Lock Status **/
#define PIOB_PIO_LOCKSR_P22		(1 << 22)
/** PIOB_PIO_LOCKSR_P21 Lock Status **/
#define PIOB_PIO_LOCKSR_P21		(1 << 21)
/** PIOB_PIO_LOCKSR_P20 Lock Status **/
#define PIOB_PIO_LOCKSR_P20		(1 << 20)
/** PIOB_PIO_LOCKSR_P19 Lock Status **/
#define PIOB_PIO_LOCKSR_P19		(1 << 19)
/** PIOB_PIO_LOCKSR_P18 Lock Status **/
#define PIOB_PIO_LOCKSR_P18		(1 << 18)
/** PIOB_PIO_LOCKSR_P17 Lock Status **/
#define PIOB_PIO_LOCKSR_P17		(1 << 17)
/** PIOB_PIO_LOCKSR_P16 Lock Status **/
#define PIOB_PIO_LOCKSR_P16		(1 << 16)
/** PIOB_PIO_LOCKSR_P15 Lock Status **/
#define PIOB_PIO_LOCKSR_P15		(1 << 15)
/** PIOB_PIO_LOCKSR_P14 Lock Status **/
#define PIOB_PIO_LOCKSR_P14		(1 << 14)
/** PIOB_PIO_LOCKSR_P13 Lock Status **/
#define PIOB_PIO_LOCKSR_P13		(1 << 13)
/** PIOB_PIO_LOCKSR_P12 Lock Status **/
#define PIOB_PIO_LOCKSR_P12		(1 << 12)
/** PIOB_PIO_LOCKSR_P11 Lock Status **/
#define PIOB_PIO_LOCKSR_P11		(1 << 11)
/** PIOB_PIO_LOCKSR_P10 Lock Status **/
#define PIOB_PIO_LOCKSR_P10		(1 << 10)
/** PIOB_PIO_LOCKSR_P9 Lock Status **/
#define PIOB_PIO_LOCKSR_P9		(1 << 9)
/** PIOB_PIO_LOCKSR_P8 Lock Status **/
#define PIOB_PIO_LOCKSR_P8		(1 << 8)
/** PIOB_PIO_LOCKSR_P7 Lock Status **/
#define PIOB_PIO_LOCKSR_P7		(1 << 7)
/** PIOB_PIO_LOCKSR_P6 Lock Status **/
#define PIOB_PIO_LOCKSR_P6		(1 << 6)
/** PIOB_PIO_LOCKSR_P5 Lock Status **/
#define PIOB_PIO_LOCKSR_P5		(1 << 5)
/** PIOB_PIO_LOCKSR_P4 Lock Status **/
#define PIOB_PIO_LOCKSR_P4		(1 << 4)
/** PIOB_PIO_LOCKSR_P3 Lock Status **/
#define PIOB_PIO_LOCKSR_P3		(1 << 3)
/** PIOB_PIO_LOCKSR_P2 Lock Status **/
#define PIOB_PIO_LOCKSR_P2		(1 << 2)
/** PIOB_PIO_LOCKSR_P1 Lock Status **/
#define PIOB_PIO_LOCKSR_P1		(1 << 1)
/** PIOB_PIO_LOCKSR_P0 Lock Status **/
#define PIOB_PIO_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_wpmr PIOWPMR Write Protection Mode Register
@{*/


#define PIOB_PIO_WPMR_WPKEY_SHIFT		8
#define PIOB_PIO_WPMR_WPKEY_MASK		0xffffff
/** @defgroup piob_pio_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

