grevaillot/svd_tools/headers/ATSAMV71Q20/piob.h
/** PIOB_PIO_WPMR_WPEN Write Protection Enable **/
#define PIOB_PIO_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup piob_pio_wpsr PIOWPSR Write Protection Status Register
@{*/


#define PIOB_PIO_WPSR_WPVSRC_SHIFT		8
#define PIOB_PIO_WPSR_WPVSRC_MASK		0xffff
/** @defgroup piob_pio_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** PIOB_PIO_WPSR_WPVS Write Protection Violation Status **/
#define PIOB_PIO_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup piob_pio_version PIOVERSION Version Register
@{*/


#define PIOB_PIO_VERSION_MFN_SHIFT		16
#define PIOB_PIO_VERSION_MFN_MASK		0x07
/** @defgroup piob_pio_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define PIOB_PIO_VERSION_VERSION_SHIFT		0
#define PIOB_PIO_VERSION_VERSION_MASK		0xfff
/** @defgroup piob_pio_version_version VERSION Hardware Module Version
@{*/
/**@}*/


/**@}*/

/** @defgroup piob_pio_schmitt PIOSCHMITT Schmitt Trigger Register
@{*/

/** PIOB_PIO_SCHMITT_SCHMITT31 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT31		(1 << 31)
/** PIOB_PIO_SCHMITT_SCHMITT30 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT30		(1 << 30)
/** PIOB_PIO_SCHMITT_SCHMITT29 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT29		(1 << 29)
/** PIOB_PIO_SCHMITT_SCHMITT28 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT28		(1 << 28)
/** PIOB_PIO_SCHMITT_SCHMITT27 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT27		(1 << 27)
/** PIOB_PIO_SCHMITT_SCHMITT26 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT26		(1 << 26)
/** PIOB_PIO_SCHMITT_SCHMITT25 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT25		(1 << 25)
/** PIOB_PIO_SCHMITT_SCHMITT24 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT24		(1 << 24)
/** PIOB_PIO_SCHMITT_SCHMITT23 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT23		(1 << 23)
/** PIOB_PIO_SCHMITT_SCHMITT22 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT22		(1 << 22)
/** PIOB_PIO_SCHMITT_SCHMITT21 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT21		(1 << 21)
/** PIOB_PIO_SCHMITT_SCHMITT20 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT20		(1 << 20)
/** PIOB_PIO_SCHMITT_SCHMITT19 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT19		(1 << 19)
/** PIOB_PIO_SCHMITT_SCHMITT18 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT18		(1 << 18)
/** PIOB_PIO_SCHMITT_SCHMITT17 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT17		(1 << 17)
/** PIOB_PIO_SCHMITT_SCHMITT16 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT16		(1 << 16)
/** PIOB_PIO_SCHMITT_SCHMITT15 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT15		(1 << 15)
/** PIOB_PIO_SCHMITT_SCHMITT14 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT14		(1 << 14)
/** PIOB_PIO_SCHMITT_SCHMITT13 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT13		(1 << 13)
/** PIOB_PIO_SCHMITT_SCHMITT12 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT12		(1 << 12)
/** PIOB_PIO_SCHMITT_SCHMITT11 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT11		(1 << 11)
/** PIOB_PIO_SCHMITT_SCHMITT10 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT10		(1 << 10)
/** PIOB_PIO_SCHMITT_SCHMITT9 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT9		(1 << 9)
/** PIOB_PIO_SCHMITT_SCHMITT8 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT8		(1 << 8)
/** PIOB_PIO_SCHMITT_SCHMITT7 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT7		(1 << 7)
/** PIOB_PIO_SCHMITT_SCHMITT6 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT6		(1 << 6)
/** PIOB_PIO_SCHMITT_SCHMITT5 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT5		(1 << 5)
/** PIOB_PIO_SCHMITT_SCHMITT4 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT4		(1 << 4)
/** PIOB_PIO_SCHMITT_SCHMITT3 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT3		(1 << 3)
/** PIOB_PIO_SCHMITT_SCHMITT2 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT2		(1 << 2)
/** PIOB_PIO_SCHMITT_SCHMITT1 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT1		(1 << 1)
/** PIOB_PIO_SCHMITT_SCHMITT0 Schmitt Trigger Control **/
#define PIOB_PIO_SCHMITT_SCHMITT0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_driver PIODRIVER I/O Drive Register
@{*/

/** PIOB_PIO_DRIVER_LINE31 Drive of PIO Line 31 **/
#define PIOB_PIO_DRIVER_LINE31		(1 << 31)
/** PIOB_PIO_DRIVER_LINE30 Drive of PIO Line 30 **/
#define PIOB_PIO_DRIVER_LINE30		(1 << 30)
/** PIOB_PIO_DRIVER_LINE29 Drive of PIO Line 29 **/
#define PIOB_PIO_DRIVER_LINE29		(1 << 29)
/** PIOB_PIO_DRIVER_LINE28 Drive of PIO Line 28 **/
#define PIOB_PIO_DRIVER_LINE28		(1 << 28)
/** PIOB_PIO_DRIVER_LINE27 Drive of PIO Line 27 **/
#define PIOB_PIO_DRIVER_LINE27		(1 << 27)
/** PIOB_PIO_DRIVER_LINE26 Drive of PIO Line 26 **/
#define PIOB_PIO_DRIVER_LINE26		(1 << 26)
/** PIOB_PIO_DRIVER_LINE25 Drive of PIO Line 25 **/
#define PIOB_PIO_DRIVER_LINE25		(1 << 25)
/** PIOB_PIO_DRIVER_LINE24 Drive of PIO Line 24 **/
#define PIOB_PIO_DRIVER_LINE24		(1 << 24)
/** PIOB_PIO_DRIVER_LINE23 Drive of PIO Line 23 **/
#define PIOB_PIO_DRIVER_LINE23		(1 << 23)
/** PIOB_PIO_DRIVER_LINE22 Drive of PIO Line 22 **/
#define PIOB_PIO_DRIVER_LINE22		(1 << 22)
/** PIOB_PIO_DRIVER_LINE21 Drive of PIO Line 21 **/
#define PIOB_PIO_DRIVER_LINE21		(1 << 21)
/** PIOB_PIO_DRIVER_LINE20 Drive of PIO Line 20 **/
#define PIOB_PIO_DRIVER_LINE20		(1 << 20)
/** PIOB_PIO_DRIVER_LINE19 Drive of PIO Line 19 **/
#define PIOB_PIO_DRIVER_LINE19		(1 << 19)
/** PIOB_PIO_DRIVER_LINE18 Drive of PIO Line 18 **/
#define PIOB_PIO_DRIVER_LINE18		(1 << 18)
/** PIOB_PIO_DRIVER_LINE17 Drive of PIO Line 17 **/
#define PIOB_PIO_DRIVER_LINE17		(1 << 17)
/** PIOB_PIO_DRIVER_LINE16 Drive of PIO Line 16 **/
#define PIOB_PIO_DRIVER_LINE16		(1 << 16)
/** PIOB_PIO_DRIVER_LINE15 Drive of PIO Line 15 **/
#define PIOB_PIO_DRIVER_LINE15		(1 << 15)
/** PIOB_PIO_DRIVER_LINE14 Drive of PIO Line 14 **/
#define PIOB_PIO_DRIVER_LINE14		(1 << 14)
/** PIOB_PIO_DRIVER_LINE13 Drive of PIO Line 13 **/
#define PIOB_PIO_DRIVER_LINE13		(1 << 13)
/** PIOB_PIO_DRIVER_LINE12 Drive of PIO Line 12 **/
#define PIOB_PIO_DRIVER_LINE12		(1 << 12)
/** PIOB_PIO_DRIVER_LINE11 Drive of PIO Line 11 **/
#define PIOB_PIO_DRIVER_LINE11		(1 << 11)
/** PIOB_PIO_DRIVER_LINE10 Drive of PIO Line 10 **/
#define PIOB_PIO_DRIVER_LINE10		(1 << 10)
/** PIOB_PIO_DRIVER_LINE9 Drive of PIO Line 9 **/
#define PIOB_PIO_DRIVER_LINE9		(1 << 9)
/** PIOB_PIO_DRIVER_LINE8 Drive of PIO Line 8 **/
#define PIOB_PIO_DRIVER_LINE8		(1 << 8)
/** PIOB_PIO_DRIVER_LINE7 Drive of PIO Line 7 **/
#define PIOB_PIO_DRIVER_LINE7		(1 << 7)
/** PIOB_PIO_DRIVER_LINE6 Drive of PIO Line 6 **/
#define PIOB_PIO_DRIVER_LINE6		(1 << 6)
/** PIOB_PIO_DRIVER_LINE5 Drive of PIO Line 5 **/
#define PIOB_PIO_DRIVER_LINE5		(1 << 5)
/** PIOB_PIO_DRIVER_LINE4 Drive of PIO Line 4 **/
#define PIOB_PIO_DRIVER_LINE4		(1 << 4)
/** PIOB_PIO_DRIVER_LINE3 Drive of PIO Line 3 **/
#define PIOB_PIO_DRIVER_LINE3		(1 << 3)
/** PIOB_PIO_DRIVER_LINE2 Drive of PIO Line 2 **/
#define PIOB_PIO_DRIVER_LINE2		(1 << 2)
/** PIOB_PIO_DRIVER_LINE1 Drive of PIO Line 1 **/
#define PIOB_PIO_DRIVER_LINE1		(1 << 1)
/** PIOB_PIO_DRIVER_LINE0 Drive of PIO Line 0 **/
#define PIOB_PIO_DRIVER_LINE0		(1 << 0)

/**@}*/

